A = int(input("Введите целое число A: "))

# Задача 10.1 (чётность)
is_even = A % 2 == 0
print("10.1: Число A чётное?", is_even)

# Задача 10.2 (нечётность)
is_odd = A % 2 != 0
print("10.2: Число A нечётное?", is_odd)